In [4]:
import pandas as pd

In [7]:
data = [
    {'Nombre': 'Ali', 'Edad':36, 'Ciudad': 'Puebla'},
    {'Nombre': 'Sara', 'Edad': 12, 'Ciudad':'Pue' },
]

df = pd.DataFrame(data)

In [8]:
df

  Nombre  Edad  Ciudad
0    Ali    36  Puebla
1   Sara    12     Pue

In [9]:
nombres = df['Nombre']
nombres

0     Ali
1    Sara
Name: Nombre, dtype: object

In [20]:
df['Salario'] = [1,2]

In [14]:
df

  Nombre  Edad  Ciudad  Salario
0    Ali    36  Puebla        1
1   Sara    12     Pue        2

In [21]:
df.drop('Salario', axis=1, inplace=True)

In [16]:
df

  Nombre  Edad  Ciudad
0    Ali    36  Puebla
1   Sara    12     Pue